"""
Задание 10. Регулярное выражение для валидации госномера авто
Предметная область: Автосервис (вариант 28)
"""

import re

# =====================================================
# Регулярное выражение для российского госномера
# =====================================================
# Формат: Буква + 3 цифры + 2 буквы + 2-3 цифры (регион)
# Допустимые буквы: А, В, Е, К, М, Н, О, Р, С, Т, У, Х
# =====================================================

RUSSIAN_PLATE_PATTERN = r'^[АВЕКМНОРСТУХ]\d{3}[АВЕКМНОРСТУХ]{2}\d{2,3}$'

# Компилируем regex для производительности
plate_regex = re.compile(RUSSIAN_PLATE_PATTERN)


def validate_plate(plate: str) -> bool:
    """
    Проверяет, является ли строка валидным российским госномером.
    
    Args:
        plate: Строка с номером для проверки
        
    Returns:
        True если номер валиден, False в противном случае
    """
    return bool(plate_regex.match(plate))


# =====================================================
# Тестовый набор данных
# =====================================================

test_cases = [
    # Валидные номера
    ("А123ВС77", True),
    ("В777АА199", True),
    ("Е001КМ50", True),
    ("Н999РО99", True),
    ("Х999РР777", True),
    
    # Невалидные номера
    ("а123вс77", False),      # строчные буквы
    ("A123BC77", False),      # латиница
    ("123АВС77", False),      # начинается с цифры
    ("А123ВС7", False),       # слишком короткий (1 цифра в регионе)
    ("А123ВС7777", False),    # слишком длинный (4 цифры в регионе)
    ("Ы123ВС77", False),      # недопустимая буква (Ы)
    ("А123ВС", False),        # нет региона
    ("АВС12377", False),      # буквы до цифр
    ("А12ВС77", False),       # 2 цифры вместо 3
]

# =====================================================
# Запуск тестов
# =====================================================

def run_tests():
    """Запускает тестирование регулярного выражения на наборе примеров"""
    print("=" * 60)
    print("Тестирование регулярного выражения для госномера авто")
    print("=" * 60)
    print(f"Регулярное выражение: {RUSSIAN_PLATE_PATTERN}")
    print("=" * 60)
    
    passed = 0
    failed = 0
    
    for plate, expected in test_cases:
        result = validate_plate(plate)
        status = "✓ Валидный" if result else "✗ Невалидный"
        expected_status = "✓ Валидный" if expected else "✗ Невалидный"
        
        if result == expected:
            print(f"[OK] {plate:15} → {status}")
            passed += 1
        else:
            print(f"[FAIL] {plate:15} → {status} (ожидалось: {expected_status})")
            failed += 1
    
    print("=" * 60)
    print(f"Результат: {passed} пройдено, {failed} не пройдено")
    print("=" * 60)
    
    if failed == 0:
        print("✅ Все тесты пройдены! Регулярное выражение корректно.")
    else:
        print("❌ Есть ошибки. Проверьте регулярное выражение.")


if __name__ == "__main__":
    run_tests()